_posts/technology/2021-01-28-emacs-inside-manjaro-wsl2-windows.html
---
layout: post
title: 在 Windows WSL2 中安装 Manjaro 通过 XServer 使用 Emacs
categories: [technology]
tags: [manjaro, wsl2, emacs]
---

<p>
一直在 Cygwin 中的 Emacs-w32 这个版本的 Emacs ，用的也都好好的。可是因为公司强制安装了360杀毒软件，这下麻烦大了，Emacs 中访问文件的速度变得出奇的慢，慢到无法忍受。本来就很慢，还稍微能忍受。于是安装 Ubuntu 双系统，规避杀毒软件。可是，Ubuntu
在我这个 Dell 工作站上时不时显示卡住，重启才行。
</p>

<p>
本来想着在 Ubuntu 下，安装个 Gentoo ，可能用起来会舒服些。然后给硬盘分区的时候，把系统分区搞坏了。只能回到 Windows 了。确实，有些办公软件，还是要用 Windows 的。这时候，发现了 WSL 这个好东西。即 Windows Subsystem Linux ，已经升级到 WSL2 了。
</p>

<p>
以下记录下，Emacs 在 WSL2 中的 Manjaro 里配置的过程。
</p>

<div id="outline-container-orgb43fce4" class="outline-2">
<h2 id="orgb43fce4"><span class="section-number-2">1</span> 安装 WSL Manjaro</h2>
<div class="outline-text-2" id="text-1">
<p>
首先，去这个地址 <a href="https://github.com/sileshn/ManjaroWSL">https://github.com/sileshn/ManjaroWSL</a> 找到 ManjaroWSL 的安装包。下载地址在这里：<a href="https://github.com/sileshn/ManjaroWSL/releases">https://github.com/sileshn/ManjaroWSL/releases</a> ，选最新的
release 即可。
</p>

<p>
然后，找个地方解压，解压后，就两个文件，一个是用来配置的主程序，还有个 Manjaro
的根文件系统。
</p>

<pre class="example">
  -rwxrwxrwx 1 209K Jan 27 17:13 Manjaro.exe
  -rwxrwxrwx 1 364M Jan 27 17:13 rootfs.tar.gz
</pre>

<p>
参考安装说明，进行安装。
</p>

<p>
打开 cmd 执行：
</p>

<div class="org-src-container">
<pre class="src src-shell">wsl --set-default-version 2 <span style="color: #3F7F5F;"># </span><span style="color: #3F7F5F;">&#35774;&#32622; wsl &#29256;&#26412;</span>
<span style="color: #7F0055; font-weight: bold;">cd</span> &lt;&#21018;&#35299;&#21387;&#30340; Manjaro.exe &#25152;&#22312;&#30340;&#25991;&#20214;&#22841;&gt;
Manjaro.exe                 <span style="color: #3F7F5F;"># </span><span style="color: #3F7F5F;">&#36816;&#34892; Manjaro.exe</span>
</pre>
</div>

<p>
完了之后，再执行 Manjaro.exe 就进入 Manjaro Linux 了。就是这么简单。
</p>

<p>
接下来，在 Manjaro 的 shell 下执行（以 kimim 用户为例）：
</p>

<div class="org-src-container">
<pre class="src src-shell">useradd -m -G wheel -s /bin/bash kimim
passwd kimim
<span style="color: #7F0055; font-weight: bold;">exit</span> <span style="color: #3F7F5F;"># </span><span style="color: #3F7F5F;">&#36864;&#20986;</span>
</pre>
</div>

<p>
接着在 cmd 中，使用 WSL Manjaro 的默认用户名：
</p>

<div class="org-src-container">
<pre class="src src-shell">Manjaro.exe config --default-user kimim
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e4aa30" class="outline-2">
<h2 id="org2e4aa30"><span class="section-number-2">2</span> 进入 WSL Manjaro Linux</h2>
<div class="outline-text-2" id="text-2">
<p>
登录 Manjaro 后，通过可爱的 pacman 安装 Emacs:
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo pacman -S emacs
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebc693f" class="outline-2">
<h2 id="orgebc693f"><span class="section-number-2">3</span> 设置 XServer</h2>
<div class="outline-text-2" id="text-3">
<p>
同时，可以下载 VCXSRV ：<a href="https://sourceforge.net/projects/vcxsrv/">https://sourceforge.net/projects/vcxsrv/</a>
</p>

<p>
安装在 Windows 上。接着，找到桌面上的 XLaunch ，右键打开属性菜单，在“兼容性”这一个选项中，点击“更改高 DPI 设置”。然后，双击 LOGO 运行它。
</p>

<p>
选择：
</p>
<ol class="org-ol">
<li>Multiple Windows</li>
<li>Display number -1</li>
<li>Start no client</li>
<li>Clipboard</li>
<li>Primary Selection</li>
<li>Native opengl</li>
<li>Disable access control</li>
</ol>
</div>
</div>

<div id="outline-container-org3c49733" class="outline-2">
<h2 id="org3c49733"><span class="section-number-2">4</span> 运行 Emacs</h2>
<div class="outline-text-2" id="text-4">
<p>
等 Emacs 安装好之后，按照 <a href="https://github.com/kimim/kimim-emacs">https://github.com/kimim/kimim-emacs</a> 的说明。
</p>

<p>
下载字体：
</p>
<ul class="org-ul">
<li><a href="https://fonts.google.com/specimen/Inconsolata">https://fonts.google.com/specimen/Inconsolata</a></li>
<li><a href="https://github.com/loseblue/yaheiInconsolata.ttf">https://github.com/loseblue/yaheiInconsolata.ttf</a></li>
</ul>

<p>
在 Manjaro shell 里将字体移到 <code>/usr/local/share/fonts/</code> 下。
</p>

<p>
然后：
</p>

<div class="org-src-container">
<pre class="src src-shell">git clone https://github.com/kimim/kimim-emacs &amp;&amp; <span style="color: #2A00FF;">\</span>
cp kimim-emacs/.emacs ~
emacs
</pre>
</div>
</div>
</div>

<div id="outline-container-org76f423b" class="outline-2">
<h2 id="org76f423b"><span class="section-number-2">5</span> 安装 emacs-rime</h2>
<div class="outline-text-2" id="text-5">
<p>
因为 Windows 的输入法没法给 X 应用用，所以需要自带输入法。参考：<a href="https://github.com/DogLooksGood/emacs-rime">https://github.com/DogLooksGood/emacs-rime</a>
</p>

<p>
安装 emacs-rime 输入法。
</p>
</div>
</div>

<div id="outline-container-org89eecb5" class="outline-2">
<h2 id="org89eecb5"><span class="section-number-2">6</span> 注意事项</h2>
<div class="outline-text-2" id="text-6">
<p>
Rime 小狼毫和 X 程序有冲突，激活的时候，按上下左右，Del 等按键，会产生一连串数字。所以，使用 Emacs 的时候，要确保 Windows 切换到英文输入法状态。
</p>
</div>
</div>
